docs/test/results/20260321/k6-knee/comment-vus300.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 45s max duration (incl. graceful stop):
              * default: 300 looping VUs for 15s (gracefulStop: 30s)


running (01.8s), 300/300 VUs, 581 complete and 0 interrupted iterations
default   [   6% ] 300 VUs  01.0s/15s

running (03.9s), 300/300 VUs, 1085 complete and 0 interrupted iterations
default   [  13% ] 300 VUs  02.0s/15s

running (04.9s), 300/300 VUs, 1441 complete and 0 interrupted iterations
default   [  20% ] 300 VUs  03.0s/15s

running (05.9s), 300/300 VUs, 1953 complete and 0 interrupted iterations
default   [  26% ] 300 VUs  04.0s/15s

running (06.9s), 300/300 VUs, 2796 complete and 0 interrupted iterations
default   [  33% ] 300 VUs  05.0s/15s

running (07.9s), 300/300 VUs, 3533 complete and 0 interrupted iterations
default   [  40% ] 300 VUs  06.0s/15s

running (08.9s), 300/300 VUs, 4407 complete and 0 interrupted iterations
default   [  46% ] 300 VUs  07.0s/15s

running (09.9s), 300/300 VUs, 5293 complete and 0 interrupted iterations
default   [  53% ] 300 VUs  08.0s/15s

running (10.9s), 300/300 VUs, 6135 complete and 0 interrupted iterations
default   [  60% ] 300 VUs  09.0s/15s

running (11.9s), 300/300 VUs, 7035 complete and 0 interrupted iterations
default   [  66% ] 300 VUs  10.0s/15s

running (12.9s), 300/300 VUs, 7862 complete and 0 interrupted iterations
default   [  73% ] 300 VUs  11.0s/15s

running (13.9s), 300/300 VUs, 8707 complete and 0 interrupted iterations
default   [  80% ] 300 VUs  12.0s/15s

running (14.9s), 300/300 VUs, 9600 complete and 0 interrupted iterations
default   [  86% ] 300 VUs  13.0s/15s

running (15.9s), 300/300 VUs, 10388 complete and 0 interrupted iterations
default   [  93% ] 300 VUs  14.0s/15s

running (16.9s), 300/300 VUs, 11170 complete and 0 interrupted iterations
default   [ 100% ] 300 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11534   665.521631/s
    checks_succeeded...: 100.00% 11534 out of 11534
    checks_failed......: 0.00%   0 out of 11534

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=436.51ms min=10.46ms med=370.43ms max=3.28s p(90)=674.02ms p(95)=1.03s    p(99)=1.96s
      { expected_response:true }...: avg=436.51ms min=10.46ms med=370.43ms max=3.28s p(90)=674.02ms p(95)=1.03s    p(99)=1.96s
    http_req_failed................: 0.00%  0 out of 11534
    http_reqs......................: 11534  665.521631/s

    EXECUTION
    iteration_duration.............: avg=393.17ms min=10.53ms med=369.92ms max=2.55s p(90)=609.16ms p(95)=751.07ms p(99)=1.11s
    iterations.....................: 11534  665.521631/s
    vus............................: 300    min=300        max=300
    vus_max........................: 300    min=300        max=300

    NETWORK
    data_received..................: 18 MB  1.1 MB/s
    data_sent......................: 1.6 MB 93 kB/s



running (17.3s), 000/300 VUs, 11534 complete and 0 interrupted iterations
default ✓ [ 100% ] 300 VUs  15s