docs/test/results/20260321/k6-knee/id-generator-vus120.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 120 max VUs, 45s max duration (incl. graceful stop):
              * default: 120 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 120/120 VUs, 242 complete and 0 interrupted iterations
default   [   7% ] 120 VUs  01.0s/15s

running (04.0s), 120/120 VUs, 609 complete and 0 interrupted iterations
default   [  13% ] 120 VUs  02.0s/15s

running (05.0s), 120/120 VUs, 1017 complete and 0 interrupted iterations
default   [  20% ] 120 VUs  03.0s/15s

running (06.0s), 120/120 VUs, 1398 complete and 0 interrupted iterations
default   [  27% ] 120 VUs  04.0s/15s

running (07.0s), 120/120 VUs, 1747 complete and 0 interrupted iterations
default   [  33% ] 120 VUs  05.0s/15s

running (08.0s), 120/120 VUs, 2003 complete and 0 interrupted iterations
default   [  40% ] 120 VUs  06.0s/15s

running (09.0s), 120/120 VUs, 2336 complete and 0 interrupted iterations
default   [  47% ] 120 VUs  07.0s/15s

running (10.0s), 120/120 VUs, 2709 complete and 0 interrupted iterations
default   [  53% ] 120 VUs  08.0s/15s

running (11.0s), 120/120 VUs, 3082 complete and 0 interrupted iterations
default   [  60% ] 120 VUs  09.0s/15s

running (12.0s), 120/120 VUs, 3400 complete and 0 interrupted iterations
default   [  67% ] 120 VUs  10.0s/15s

running (13.0s), 120/120 VUs, 3801 complete and 0 interrupted iterations
default   [  73% ] 120 VUs  11.0s/15s

running (14.0s), 120/120 VUs, 4200 complete and 0 interrupted iterations
default   [  80% ] 120 VUs  12.0s/15s

running (15.0s), 120/120 VUs, 4572 complete and 0 interrupted iterations
default   [  87% ] 120 VUs  13.0s/15s

running (16.0s), 120/120 VUs, 4899 complete and 0 interrupted iterations
default   [  93% ] 120 VUs  14.0s/15s

running (17.0s), 120/120 VUs, 5265 complete and 0 interrupted iterations
default   [ 100% ] 120 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5389    311.569554/s
    checks_succeeded...: 100.00% 5389 out of 5389
    checks_failed......: 0.00%   0 out of 5389

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=381.09ms min=15.99ms med=293.61ms max=2.63s    p(90)=580.43ms p(95)=744.68ms p(99)=1.5s    
      { expected_response:true }...: avg=381.09ms min=15.99ms med=293.61ms max=2.63s    p(90)=580.43ms p(95)=744.68ms p(99)=1.5s    
    http_req_failed................: 0.00%  0 out of 5389
    http_reqs......................: 5389   311.569554/s

    EXECUTION
    iteration_duration.............: avg=337.48ms min=16.08ms med=290.93ms max=896.74ms p(90)=544.8ms  p(95)=592.71ms p(99)=719.99ms
    iterations.....................: 5389   311.569554/s
    vus............................: 120    min=120       max=120
    vus_max........................: 120    min=120       max=120

    NETWORK
    data_received..................: 1.2 MB 71 kB/s
    data_sent......................: 539 kB 31 kB/s



running (17.3s), 000/120 VUs, 5389 complete and 0 interrupted iterations
default ✓ [ 100% ] 120 VUs  15s