docs/test/results/20260321/k6-knee/id-generator-vus130.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 130 max VUs, 45s max duration (incl. graceful stop):
              * default: 130 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 130/130 VUs, 192 complete and 0 interrupted iterations
default   [   7% ] 130 VUs  01.0s/15s

running (02.0s), 130/130 VUs, 494 complete and 0 interrupted iterations
default   [  13% ] 130 VUs  02.0s/15s

running (03.0s), 130/130 VUs, 723 complete and 0 interrupted iterations
default   [  20% ] 130 VUs  03.0s/15s

running (04.0s), 130/130 VUs, 1038 complete and 0 interrupted iterations
default   [  27% ] 130 VUs  04.0s/15s

running (05.0s), 130/130 VUs, 1434 complete and 0 interrupted iterations
default   [  33% ] 130 VUs  05.0s/15s

running (06.0s), 130/130 VUs, 1858 complete and 0 interrupted iterations
default   [  40% ] 130 VUs  06.0s/15s

running (07.0s), 130/130 VUs, 2223 complete and 0 interrupted iterations
default   [  47% ] 130 VUs  07.0s/15s

running (08.0s), 130/130 VUs, 2620 complete and 0 interrupted iterations
default   [  53% ] 130 VUs  08.0s/15s

running (09.0s), 130/130 VUs, 3027 complete and 0 interrupted iterations
default   [  60% ] 130 VUs  09.0s/15s

running (10.0s), 130/130 VUs, 3423 complete and 0 interrupted iterations
default   [  67% ] 130 VUs  10.0s/15s

running (11.0s), 130/130 VUs, 3783 complete and 0 interrupted iterations
default   [  73% ] 130 VUs  11.0s/15s

running (12.0s), 130/130 VUs, 4204 complete and 0 interrupted iterations
default   [  80% ] 130 VUs  12.0s/15s

running (13.0s), 130/130 VUs, 4605 complete and 0 interrupted iterations
default   [  87% ] 130 VUs  13.0s/15s

running (14.0s), 130/130 VUs, 4995 complete and 0 interrupted iterations
default   [  93% ] 130 VUs  14.0s/15s

running (15.0s), 130/130 VUs, 5397 complete and 0 interrupted iterations
default   [ 100% ] 130 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5537    363.141514/s
    checks_succeeded...: 100.00% 5537 out of 5537
    checks_failed......: 0.00%   0 out of 5537

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=354.13ms min=33.99ms med=336.23ms max=3.97s p(90)=513.23ms p(95)=573.63ms p(99)=805.35ms
      { expected_response:true }...: avg=354.13ms min=33.99ms med=336.23ms max=3.97s p(90)=513.23ms p(95)=573.63ms p(99)=805.35ms
    http_req_failed................: 0.00%  0 out of 5537
    http_reqs......................: 5537   363.141514/s

    EXECUTION
    iteration_duration.............: avg=355.75ms min=34.11ms med=336.84ms max=4.03s p(90)=521.21ms p(95)=581.64ms p(99)=867.33ms
    iterations.....................: 5537   363.141514/s
    vus............................: 130    min=130       max=130
    vus_max........................: 130    min=130       max=130

    NETWORK
    data_received..................: 1.3 MB 83 kB/s
    data_sent......................: 554 kB 36 kB/s



running (15.2s), 000/130 VUs, 5537 complete and 0 interrupted iterations
default ✓ [ 100% ] 130 VUs  15s