docs/test/results/20260321/k6-knee/id-generator-vus140.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 140 max VUs, 45s max duration (incl. graceful stop):
              * default: 140 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 140/140 VUs, 282 complete and 0 interrupted iterations
default   [   6% ] 140 VUs  01.0s/15s

running (02.0s), 140/140 VUs, 640 complete and 0 interrupted iterations
default   [  13% ] 140 VUs  02.0s/15s

running (03.0s), 140/140 VUs, 1015 complete and 0 interrupted iterations
default   [  20% ] 140 VUs  03.0s/15s

running (04.0s), 140/140 VUs, 1403 complete and 0 interrupted iterations
default   [  26% ] 140 VUs  04.0s/15s

running (05.0s), 140/140 VUs, 1796 complete and 0 interrupted iterations
default   [  33% ] 140 VUs  05.0s/15s

running (06.0s), 140/140 VUs, 2194 complete and 0 interrupted iterations
default   [  40% ] 140 VUs  06.0s/15s

running (07.0s), 140/140 VUs, 2568 complete and 0 interrupted iterations
default   [  46% ] 140 VUs  07.0s/15s

running (08.0s), 140/140 VUs, 2930 complete and 0 interrupted iterations
default   [  53% ] 140 VUs  08.0s/15s

running (09.0s), 140/140 VUs, 3310 complete and 0 interrupted iterations
default   [  60% ] 140 VUs  09.0s/15s

running (10.0s), 140/140 VUs, 3653 complete and 0 interrupted iterations
default   [  66% ] 140 VUs  10.0s/15s

running (11.0s), 140/140 VUs, 4052 complete and 0 interrupted iterations
default   [  73% ] 140 VUs  11.0s/15s

running (12.0s), 140/140 VUs, 4419 complete and 0 interrupted iterations
default   [  80% ] 140 VUs  12.0s/15s

running (13.0s), 140/140 VUs, 4810 complete and 0 interrupted iterations
default   [  87% ] 140 VUs  13.0s/15s

running (14.0s), 140/140 VUs, 5169 complete and 0 interrupted iterations
default   [  93% ] 140 VUs  14.0s/15s

running (15.0s), 140/140 VUs, 5566 complete and 0 interrupted iterations
default   [ 100% ] 140 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 5734    375.197945/s
    checks_succeeded...: 100.00% 5734 out of 5734
    checks_failed......: 0.00%   0 out of 5734

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=368.74ms min=28.09ms med=335.22ms max=812.48ms p(90)=582.38ms p(95)=651.11ms p(99)=719.97ms
      { expected_response:true }...: avg=368.74ms min=28.09ms med=335.22ms max=812.48ms p(90)=582.38ms p(95)=651.11ms p(99)=719.97ms
    http_req_failed................: 0.00%  0 out of 5734
    http_reqs......................: 5734   375.197945/s

    EXECUTION
    iteration_duration.............: avg=370.84ms min=28.2ms  med=335.85ms max=812.61ms p(90)=584.09ms p(95)=655.26ms p(99)=720.1ms 
    iterations.....................: 5734   375.197945/s
    vus............................: 140    min=140       max=140
    vus_max........................: 140    min=140       max=140

    NETWORK
    data_received..................: 1.3 MB 86 kB/s
    data_sent......................: 573 kB 38 kB/s



running (15.3s), 000/140 VUs, 5734 complete and 0 interrupted iterations
default ✓ [ 100% ] 140 VUs  15s